## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_subnet.app_subnet will be created
  + resource "azurerm_subnet" "app_subnet" {
      + address_prefixes                              = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "path0053-a12-subnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "path0053-a12-rg"
      + virtual_network_name                          = "path0053-a12-vnet"
    }

  # azurerm_virtual_network.app_vnet will be created
  + resource "azurerm_virtual_network" "app_vnet" {
      + address_space                  = [
          + "10.0.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "eastus"
      + name                           = "path0053-a12-vnet"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "path0053-a12-rg"
      + subnet                         = (known after apply)
      + tags                           = {
          + "environment" = "test"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>